wale/ReTau300/fine/method1/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



momentumSource
{
   type            meanVelocityForce;
   active          on;            //on/off switch
   
   meanVelocityForceCoeffs
   {
       	selectionMode	all;
   	fieldNames	(U);
       	Ubar        	( 1 0 0 );
   }
}



// ************************************************************************* //
